andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14681-01.xml
If CRYPTO_ALG_MD = 01
00 - SHA-384
01 - SHA-512
10 - SHA-512/224
11 - SHA-512/256


</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>CRYPTO_DEST_ADDR_REG</name>
	<description>Crypto DMA destination memory</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CRYPTO_DEST_ADDR</name>
	<description>Destination address at where the result of the processing is stored. The value of this register is updated as the calculation proceeds and the output data are written to the memory.</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>CRYPTO_FETCH_ADDR_REG</name>
	<description>Crypto DMA fetch register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CRYPTO_FETCH_ADDR</name>
	<description>The memory address from where will be retrieved the data that will be processed. The value of this register is updated as the calculation proceeds and the output data are written to the memory.</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>CRYPTO_KEYS_START</name>
	<description>Crypto First position of the AES keys storage memory</description>
	<addressOffset>0x00000100</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CRYPTO_KEY_X</name>
	<description>CRYPTO_KEY_(0-63)
This is the AES keys storage memory. This memory is accessible via AHB slave interface, only when the CRYPTO is inactive (CRYPTO_INACTIVE = 1).</description>
	<access>write-only</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>CRYPTO_LEN_REG</name>
	<description>Crypto Length of the input block in bytes</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CRYPTO_LEN</name>
	<description>It contains the number of bytes of input data. If this number is not a multiple of a block size, the data is automatically extended with zeros. The value of this register is updated as the calculation proceeds and the output data are written to the memory.</description>
	<access>read-write</access>
	<bitRange>[23:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>CRYPTO_MREG0_REG</name>
	<description>Crypto Mode depended register 0</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CRYPTO_MREG0</name>
	<description>It contains information that are depended by the mode of operation, when is used the AES algorithm:
CBC - IV[31:0]
CTR - CTRBLK[31:0]. It is the initial value of the 32 bits counter.
At any other mode, the contents of this register has no meaning.</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>CRYPTO_MREG1_REG</name>
	<description>Crypto Mode depended register 1</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CRYPTO_MREG1</name>
	<description>It contains information that are depended by the mode of operation, when is used the AES algorithm:
CBC - IV[63:32]
CTR - CTRBLK[63:32]
At any other mode, the contents of this register has no meaning.</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>CRYPTO_MREG2_REG</name>
	<description>Crypto Mode depended register 2</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CRYPTO_MREG2</name>
	<description>It contains information that are depended by the mode of operation, when is used the AES algorithm:
CBC - IV[95:64]
CTR - CTRBLK[95:64]
At any other mode, the contents of this register has no meaning.</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>CRYPTO_MREG3_REG</name>
	<description>Crypto Mode depended register 3</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CRYPTO_MREG3</name>
	<description>It contains information that are depended by the mode of operation, when is used the AES algorithm:
CBC - IV[127:96]
CTR - CTRBLK[127:96]
At any other mode, the contents of this register has no meaning.</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>CRYPTO_START_REG</name>
	<description>Crypto Start calculation</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CRYPTO_START</name>
	<description>Write 1 to initiate the processing of the input data. This register is auto-cleared.</description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>CRYPTO_STATUS_REG</name>
	<description>Crypto Status register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CRYPTO_IRQ_ST</name>
	<description>The status of the interrupt request line of the CRYPTO block.
0 - There is no active interrupt request.
1 - An interrupt request is pending.</description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CRYPTO_WAIT_FOR_IN</name>
	<description>Indicates the situation where the engine waits for more input data. This is applicable when the CRYPTO_MORE_IN= 1, so the input data are fragmented in the memory.
0 - The crypto is not waiting for more input data.
1 - The crypto waits for more input data.
The CRYPTO_INACTIVE flag remains to zero to indicate that the calculation is not finished. The supervisor of the CRYPTO must program to the CRYPTO_FETCH_ADDR and CRYPTO_LEN a new input data fragment. The calculation will be continued as soon as the CRYPTO_START register will be written with 1. This action will clear the CRYPTO_WAIT_FOR_IN flag.</description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CRYPTO_INACTIVE</name>
	<description>0 - The CRYPTO is active. The processing is in progress.
1 - The CRYPTO is inactive. The processing has finished.</description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register></registers><interrupt>
	<name>BLE_WAKEUP_LP</name>
	<value>0</value>
</interrupt><interrupt>
	<name>BLE_GEN</name>
	<value>1</value>
</interrupt><interrupt>
	<name>FTDF_WAKEUP</name>
	<value>2</value>
</interrupt><interrupt>
	<name>FTDF_GEN</name>
	<value>3</value>
</interrupt><interrupt>
	<name>RFCAL</name>
	<value>4</value>
</interrupt><interrupt>
	<name>COEX</name>
	<value>5</value>
</interrupt><interrupt>
	<name>CRYPTO</name>
	<value>6</value>
</interrupt><interrupt>
	<name>MRM</name>
	<value>7</value>
</interrupt><interrupt>
	<name>UART</name>
	<value>8</value>
</interrupt><interrupt>
	<name>UART2</name>
	<value>9</value>
</interrupt><interrupt>
	<name>I2C</name>
	<value>10</value>
</interrupt><interrupt>
	<name>I2C2</name>
	<value>11</value>
</interrupt><interrupt>
	<name>SPI</name>
	<value>12</value>
</interrupt><interrupt>
	<name>SPI2</name>
	<value>13</value>
</interrupt><interrupt>
	<name>ADC</name>
	<value>14</value>
</interrupt><interrupt>
	<name>KEYBRD</name>
	<value>15</value>
</interrupt><interrupt>
	<name>IRGEN</name>
	<value>16</value>
</interrupt><interrupt>
	<name>WKUP_GPIO</name>
	<value>17</value>
</interrupt><interrupt>
	<name>SWTIM0</name>
	<value>18</value>
</interrupt><interrupt>
	<name>SWTIM1</name>
	<value>19</value>
</interrupt><interrupt>
	<name>QUADEC</name>
	<value>20</value>
</interrupt><interrupt>
	<name>USB</name>
	<value>21</value>
</interrupt><interrupt>
	<name>PCM</name>
	<value>22</value>
</interrupt><interrupt>
	<name>SRC_IN</name>
	<value>23</value>
</interrupt><interrupt>
	<name>SRC_OUT</name>
	<value>24</value>
</interrupt><interrupt>
	<name>VBUS</name>
	<value>25</value>
</interrupt><interrupt>
	<name>DMA</name>
	<value>26</value>
</interrupt><interrupt>
	<name>RF_DIAG</name>
	<value>27</value>
</interrupt><interrupt>
	<name>TRNG</name>
	<value>28</value>
</interrupt><interrupt>
	<name>DCDC</name>
	<value>29</value>
</interrupt><interrupt>
	<name>XTAL16RDY</name>
	<value>30</value>
</interrupt><interrupt>
	<name>RESERVED31</name>
	<value>31</value>
</interrupt>
</peripheral><peripheral>
	<name>ANAMISC</name>
	<version>1.0</version>
	<description>ANAMISC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50001b00</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>104</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>ANA_TEST_REG</name>
	<description>Analog test registers</description>
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>ACORE_TESTBUS_EN</name>
	<description>TBD</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TEST_STRUCTURE</name>
	<description>4 bits to select which test-structure is mapped on P1[1]
0 : open
1 : VDD (1.2V)
2 : 10uA into 66k = 5/3 x 40k (W/L=0.45/22.33)
3 : 1uA into 700k = 18.5 x 40k (W/L=0.45/22.33)
4 : 1uA(same as going into 700k)
5 : AVS (0V)
6 : 5uA into nMOST (svt) 2x1u/110n
7 : 5uA into nMOST (hvt) 2x1u/110n
8 : 5uA into nMOST (UD18) 2x1u/260n
9 : 5uA into nMOST (OD33) 2x1u/500n
a : 7.5uA into nMOST (na25) 4x1u/1.2u
b : 5uA into nMOST (0vt) 4x1u/300n
c : VDD - 5uA from pMOST (svt) 2x1u/110n
d : VDD - 5uA from pMOST (hvt) 2x1u/110n
e : VDD - 5uA from pMOST (OD33) 2x1u/400n
f : VDD - 5uA from pMOST (UD18) 2x1u/260n </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>CHARGER_CTRL1_REG</name>
	<description>Charger control register 1</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00002000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DIE_TEMP_DISABLE</name>
	<description>0: Die temperature protection enabled: charger will be disabled when die temp exceeds value set in DIE_TEMP_SET
1: Die temperature protection disabled: testmode, use only in agreement with Dialog</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DIE_TEMP_SET</name>
	<description>Die temperature protection level.
Charging will be automatically disabled if set level is exceeded and resumed when temperature has dropped few degrees below set level.
00: 0oC (do not use, for test only)
01: 50oC (do not use, for test only)
10: 80oC (default)
11: 100oC</description>
	<access>read-write</access>
	<bitRange>[13:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CHARGE_CUR</name>
	<description>Constant Current levels (typical values)
0000: 5 mA
0001: 10 mA
0010: 30 mA
0011: 45 mA
0100: 60 mA
0101: 90 mA
0110: 120 mA
0111: 150 mA
1000: 180 mA
1001: 210 mA
1010: 270 mA
1011: 300 mA
1100: 350 mA
1101: 400 mA </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>NTC_LOW_DISABLE</name>
	<description>0: Normal operation: voltage level higher than 7/8 VDD_USB will disable the charger
1: NTC low temp limit disabled: use if trickle charging below the minimum temperature is required </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>NTC_DISABLE</name>
	<description>0: Charger NTC protection enabled
1: Charger NTC protection disable</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CHARGE_ON</name>
	<description>0: Charger in powerdown
1: Charger enabled </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CHARGE_LEVEL</name>
	<description>Constant Voltage Levels
00000: 3.00V (reset)
00001: 3.40V (e.g. 2xNiMH)
00010: 3.50V
00011: 3.60V (e.g. Li-phosphate)
00100: 3.74V
00101: 3.86V
00110: 4.00V
00111: 4.05V
01000: 4.10V
01001: 4.15V
01010: 4.20V (e.g. Li-Co, Li-Mn, NMC)
01011: 4.25V
01100: 4.30V
01101: 4.35V
01110: 4.40V
01111: 4.50V
10000: 4.60V
10001: 4.90V e.g. 3xNiMH
10010: 5.00V</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>CHARGER_CTRL2_REG</name>
	<description>Charger control register 2</description>
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000f07</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CHARGER_TEST</name>
	<description>Signals are mapped on SPDIF pin.
Also set ANA_TEST_REG[ANA_TESTBUS_TO_ADCPIN] = 1

