andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14681-01.xml
The upper 16-bits are assigned to the test bus when DEM_TESTMODE[7] is set. The input test bus is copied with DEM_TESTMODE[7] is reset.</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_FSSS_I_RESULT_REG</name>
	
	<addressOffset>0x00000050</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>FSSS_I_RD</name>
	<description>Inphase result for the FSSS</description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_FSSS_MAG_RESULT_REG</name>
	
	<addressOffset>0x00000054</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>FSSS_MAG_RD</name>
	<description>Magnitude result for the FSSS</description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_FSSS_Q_RESULT_REG</name>
	
	<addressOffset>0x00000052</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>FSSS_Q_RD</name>
	<description>Quadrature result for the FSSS</description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_FTDF_COBI_HIGH_REG</name>
	
	<addressOffset>0x00000040</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000d9c3</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>COBI</name>
	
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_FTDF_COBI_LOW_REG</name>
	
	<addressOffset>0x0000003e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000522e</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>COBI</name>
	
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_FTDF_CTRL1_REG</name>
	
	<addressOffset>0x00000030</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000047c0</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CHSEL_FILT_MODE2</name>
	<description>Selects the channel selection filter in the coarse frequency estimation

0: Channel selection filter disabled
1: Channel selection filter #1 enabled
2: Channel selection filter #2 enabled
3: Channel selection filter #2 enabled</description>
	<access>read-write</access>
	<bitRange>[15:14]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CFE_NSTEP</name>
	<description>Number of preamble symbols used for the coarse frequency offset estimation</description>
	<access>read-write</access>
	<bitRange>[13:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CFE_MODE</name>
	<description>cfe_bias selects when the coarse frequency estimation is triggered

x1: When the start of FTDF signal is set
1x: When the RSSI is higher than the threshold TODO: add register and field name here</description>
	<access>read-write</access>
	<bitRange>[11:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CFE_BIAS</name>
	<description>Bias signal for the coarse frequency estimation

Fbias = cfe_bias*1.024 Hz/bit</description>
	<access>read-write</access>
	<bitRange>[9:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_FTDF_CTRL2_REG</name>
	
	<addressOffset>0x00000032</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00006910</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PD_OFFSET</name>
	<description>Offset between first found peak and the following seach windows</description>
	<access>read-write</access>
	<bitRange>[15:14]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PD_NWIN</name>
	<description>Size of the search window during the preamble detection [-PD_NWIN;+PD_NWIN]</description>
	<access>read-write</access>
	<bitRange>[13:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PD_NPEAK</name>
	<description>Number of preamble detection peaks used for the preamble detection (PD_NPEAK+2)</description>
	<access>read-write</access>
	<bitRange>[10:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PD_MODE</name>
	<description>Select when the preamble detection is triggered

0: When the start of FTDF flag is set
1: When the RSSI is larger than the threshold TODO: Add register and field names</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>NORM_EN</name>
	
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CORRTH</name>
	<description>Correlation threshold for the preamble detection

Correlation threshold = CORRTH/4</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_FTDF_CTRL3_REG</name>
	
	<addressOffset>0x00000034</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00005e00</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DS_OFFSET</name>
	<description>Offset between synchronization and frist despreading event</description>
	<access>read-write</access>
	<bitRange>[15:14]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CHSEL_FILT_MODE1</name>
	<description>Selects the channel selection filter in the demodulator

0: Channel selection filter disabled
1: Channel selection filter #1 enabled
2: Channel selection filter #2 enabled
3: Channel selection filter #2 enabled</description>
	<access>read-write</access>
	<bitRange>[13:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TIMING_CORR_EN</name>
	<description>Enable the timing tracking loop

0: Timing tracking disabled
1: Timing tracking enabled</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MATCH_FILT_EN</name>
	<description>Enable the matched filter in the demodulator

0: Matched filter disabled
1: Matched filter enabled</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>FTDF_DDC_EN</name>
	<description>Enable the IQ correction

The correction coefficients are define in the RF_DEM_IQCORRECT_REG register</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>FIF</name>
	<description>Additional frequency triming of the IF (in addition to the fixed 2 MHz)

IF = 2.0 MHz + FIF*1.024 MHz/bit</description>
	<access>read-write</access>
	<bitRange>[8:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_FTDF_CTRL4_REG</name>
	
