andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14681-01.xml
	<name>LMAC_MANUAL_PHY_ATTR_HSI</name>
	<description>HighSide injection. </description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LMAC_MANUAL_PHY_ATTR_RF_GPIO_PINS</name>
	<description>Slot-basis signals mapped on GPIO via PPA. </description>
	<access>read-write</access>
	<bitRange>[30:28]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LMAC_MANUAL_PHY_ATTR_CALCAP</name>
	<description>CalCap value. </description>
	<access>read-write</access>
	<bitRange>[27:24]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LMAC_MANUAL_PHY_ATTR_CN</name>
	<description>Channel Number. </description>
	<access>read-write</access>
	<bitRange>[23:20]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LMAC_MANUAL_PHY_ATTR_DEM_PTI</name>
	<description>DEM packet information. </description>
	<access>read-write</access>
	<bitRange>[19:16]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LMAC_MANUAL_PTI</name>
	<description>lmac_manual_pti controls the PTI interface signal when lmac_manual_mode is set </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LMAC_MANUAL_TX_FRM_NR</name>
	<description>lmac_manual_tx_frm_nr controls the entry in the tx buffer to be transmitted. </description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LMAC_MANUAL_ED_REQUEST</name>
	<description>lmac_manual_ed_request controls the ED_REQUEST interface signal when lmac_manual_mode is set </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LMAC_MANUAL_RX_PIPE_EN</name>
	<description>lmac_manual_rx_pipe_en controls the rx_enable signal towards the rx pipeline when lmac_manual_mode is set </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LMAC_MANUAL_RX_EN</name>
	<description>lmac_manual_rx_en controls the RX_EN interface signal when lmac_manual_mode is set </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LMAC_MANUAL_TX_EN</name>
	<description>lmac_manual_tx_en controls the TX_EN interface signal when lmac_manual_mode is set </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LMAC_MANUAL_PHY_EN</name>
	<description>lmac_manual_phy_en controls the PHY_EN interface signal when lmac_manual_mode is set </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LMAC_MANUAL_MODE</name>
	<description>If the control register lmac_manual_mode is set, the LMAC controller control
signals should be controlled by the lmac_manual_control registers </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_LMAC_MANUAL_OS_REG</name>
	<description>One shot register triggers transmission in manual mode</description>
	<addressOffset>0x000100a4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>LMAC_MANUAL_TX_START</name>
	<description>One shot register which triggers the transmission of a frame from the tx buffer in lmac_manual_mode </description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_LMAC_MANUAL_STATUS_REG</name>
	<description>Lmac status register in manual mode</description>
	<addressOffset>0x000100a8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ff01</resetMask>
	<fields>
	<field>
	<name>LMAC_MANUAL_ED_STAT</name>
	<description>lmac_manual_ed_stat shows the status of the ED_STAT interface signal. </description>
	<access>read-only</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LMAC_MANUAL_CCA_STAT</name>
	<description>lmac_manual_cca_stat shows the status of the CCA_STAT </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_LMAC_MASK_REG</name>
	<description>Lmac mask register</description>
	<addressOffset>0x00010094</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields>
	<field>
	<name>RXTIMEREXPIRED_M</name>
	<description>Mask bit for event &amp;quot;RxTimerExpired_e&amp;quot; </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CCASTAT_M</name>
	<description>Mask bit for event &amp;quot;CCAstat_e&amp;quot; </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>EDSCANREADY_M</name>
	<description>Mask bit for event &amp;quot;EdScanReady_e&amp;quot; </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_MACACKWAITDURATION_REG</name>
	<description>Maximum time to wait for a ACK</description>
	<addressOffset>0x00010038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000036</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>MACACKWAITDURATION</name>
	<description>Max time to wait for a (normal) ACK </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_MACENHACKWAITDURATION_REG</name>
	<description>Maximum time to wait for an enhanced ACK frame</description>
	<addressOffset>0x0001003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000360</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>MACENHACKWAITDURATION</name>
	<description>The maximum time (in ??s) to wait for an
enhanced acknowledgement frame </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_MACFCSERRORCOUNT_REG</name>
	<description>Lmac FCS error register</description>
	<addressOffset>0x00010340</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>MACFCSERRORCOUNT</name>
	<description>The number of received frames that were discarded due to an incorrect FCS. </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_MACRXADDRFAILFRMCNT_REG</name>
	<description>Discarded frames register</description>
	<addressOffset>0x00010318</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>MACRXADDRFAILFRMCNT</name>
	<description>Frames discarded due to incorrect address or PAN Id </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_MACRXSTDACKFRMOKCNT_REG</name>
	<description>Received acknowledgment frames</description>
	<addressOffset>0x00010314</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>MACRXSTDACKFRMOKCNT</name>
	<description>Standard Acknowledgment frames received </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_MACRXUNSUPFRMCNT_REG</name>
	<description>Unsupported frames register</description>
	<addressOffset>0x0001031c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>MACRXUNSUPFRMCNT</name>
	<description>Frames which do pass the checks but are not supported </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_MACTSTXACKDELAYVAL_REG</name>
	<description>Time left until next ACK is sent (us)</description>
	<addressOffset>0x00010078</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>MACTSTXACKDELAYVAL</name>
	<description>The time in us left until the ack frame is sent by the lmac </description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_MACTXSTDACKFRMCNT_REG</name>
	<description>Transmitted acknowledgment frames</description>
	<addressOffset>0x00010310</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>MACTXSTDACKFRMCNT</name>
	<description>Standard Acknowledgment frames transmitted </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_PHY_PARAMETERS_0_REG</name>
	<description>Lmac PHY parameter register</description>
	<addressOffset>0x00010180</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x76543210</resetValue>
	<resetMask>0x77777777</resetMask>
	<fields>
	<field>
	<name>RXBITPOS_7</name>
	<description>See rxBitPos_0 </description>
	<access>read-write</access>
	<bitRange>[30:28]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RXBITPOS_6</name>
	<description>See rxBitPos_0 </description>
	<access>read-write</access>
	<bitRange>[26:24]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RXBITPOS_5</name>
	<description>See rxBitPos_0 </description>
	<access>read-write</access>
	<bitRange>[22:20]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RXBITPOS_4</name>
	<description>See rxBitPos_0 </description>
	<access>read-write</access>
	<bitRange>[18:16]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RXBITPOS_3</name>
	<description>See rxBitPos_0 </description>
	<access>read-write</access>
	<bitRange>[14:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RXBITPOS_2</name>
	<description>See rxBitPos_0 </description>
	<access>read-write</access>
	<bitRange>[10:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RXBITPOS_1</name>
	<description>See rxBitPos_0 </description>
	<access>read-write</access>
	<bitRange>[6:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RXBITPOS_0</name>
	<description>Control rxBitPos(8)(3) controls the position that a bit should have at the DPHY interface.
So the default values are rxBitPos_0 = 0, rxBitPos_1 = 1, rxBitPos_2 = 2, etc.

