andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14681-01.xml
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000003</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>ZIF_MODE_EN</name>
	<description>Zero-IF testmode</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MODVAL_SEL</name>
	<description>0: Normal operation
1: Use the externally provided value for the modulation </description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MODVAL_WR</name>
	<description>Externally provided modulation value in 2s complement
&#206;&#148;f = 16 MHz x MODVAL_WR/16348 </description>
	<access>read-write</access>
	<bitRange>[13:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_SYNTH_RESULT2_BLE_REG</name>
	<description>Must be Retained</description>
	<addressOffset>0x00000022</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00001480</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CN_CAL_RD</name>
	<description>Result of the modulation gain calibration (Retained) </description>
	<access>read-only</access>
	<bitRange>[13:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>GAUSS_GAIN_RD</name>
	<description>Modulation gain after KMOD_ALPHA trimming (Not Retained) </description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_SYNTH_RESULT2_FTDF_REG</name>
	<description>Must be Retained</description>
	<addressOffset>0x00000024</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00002080</resetValue>
	<resetMask>0x00008fff</resetMask>
	<fields>
	<field>
	<name>MSK_GAIN_UPPER_RD</name>
	<description>Modulation gain after KMOD_ALPHA trimming and offset compensation (Not Retained) </description>
	<access>read-only</access>
	<bitRange>[11:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MSK_GAIN_LOWER_RD</name>
	<description>Modulation gain after KMOD_ALPHA trimming and offset compensation (Not Retained) </description>
	<access>read-only</access>
	<bitRange>[5:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_SYNTH_RESULT3_FTDF_REG</name>
	
	<addressOffset>0x00000026</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields>
	<field>
	<name>CN_CAL_FTDF_RD</name>
	<description>Result of the modulation gain calibration (Retained) </description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_SYNTH_RESULT_BLE_REG</name>
	<description>Must be Retained</description>
	<addressOffset>0x0000001e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000480</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>VCO_FREQTRIM_RD</name>
	<description>Result of the VCO calibration (Not Retained) </description>
	<access>read-only</access>
	<bitRange>[11:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>GAUSS_GAIN_CAL_RD</name>
	<description>Result of the modulation gain calibration (Retained) </description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_SYNTH_RESULT_FTDF_REG</name>
	<description>Must be Retained</description>
	<addressOffset>0x00000020</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000080</resetValue>
	<resetMask>0x0000f03f</resetMask>
	<fields>
	<field>
	<name>MSK_GAIN_CAL_RD</name>
	<description>Result of the modulation gain calibration (Retained) </description>
	<access>read-only</access>
	<bitRange>[5:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_VCOCAL_CTRL_REG</name>
	
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000000c3</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>VCOCAL_PERIOD</name>
	<description>Length of a VCO calibration step
0: 1 us
1: 2 us
2: 3 us
3: 4 us </description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>VCO_FREQTRIM_SEL</name>
	<description>0b00: use calibrated value
0b01: use calibrated value, offsetted with -1
0b10: use VCO_FREQTRIM_WR
0b11: use calcap from LUT/phyattr</description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>VCO_FREQTRIM_WR</name>
	<description>Externally provided VCO calibration value </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_VCO_CALCAP_BIT14_REG</name>
	
	<addressOffset>0x00000012</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000559d</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>VCO_CALCAP_BIT14</name>
	<description>LUT entry for bit 14 of the VCO calibration capacitance </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_VCO_CALCAP_BIT15_REG</name>
	
	<addressOffset>0x00000014</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>VCO_CALCAP_BIT15</name>
	<description>LUT entry for bit 15 of the VCO calibration capacitance </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>QSPIC</name>
	<version>1.0</version>
	<description>QSPIC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x0c000000</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>68</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>QSPIC_BURSTBRK_REG</name>
	<description>Read break sequence in Auto mode</description>
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_SEC_HF_DS</name>
	<description>Disable output during the transmission of the second half (QSPIC_BRK_WRD[3:0]). Setting this bit is only useful if QSPIC_BRK_EN =1 and QSPIC_BRK_SZ= 1.
0 - The controller drives the QSPI bus during the transmission of the QSPIC_BRK_WRD[3:0].
1 - The controller leaves the QSPI bus in Hi-Z during the transmission of the QSPIC_BRK_WORD[3:0].
</description>
	<access>read-write</access>
	<bitRange>[20:20]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>QSPIC_BRK_TX_MD</name>
	<description>The mode of the QSPI Bus during the transmission of the burst break sequence.
00 - Single
01 - Dual
10 - Quad
11 - Reserved
</description>
	<access>read-write</access>
	<bitRange>[19:18]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>QSPIC_BRK_SZ</name>
	<description>The size of Burst Break Sequence
0 - One byte (Send QSPIC_BRK_WRD[15:8])
1 - Two bytes (Send QSPIC_BRK_WRD[15:0])
</description>
	<access>read-write</access>
	<bitRange>[17:17]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>QSPIC_BRK_EN</name>
	<description>Controls the application of a special command (read burst break sequence) that is used in order to force the device to abandon the continuous read mode.
0 - The special command is not applied
1 - The special command is applied

