andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14681-01.xml
	<addressOffset>0x00000092</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>GAUSS_DAC_CTRL</name>
	<description>value 1X , Set the Gauss DAC output to high 'Z </description>
	<access>read-write</access>
	<bitRange>[3:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MGC_POLE_SW</name>
	<description>Switch in an aditional pole on the mgc amplifer to have extra filtering of the loopfilter voltage.
'0': no pole (bandwidth limited by the opamp)
'1': switch in pole to reduce amplifier bandwidth</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MGC_GAIN_SET</name>
	<description>Set the desired gain for the mgc calibration amplifier.
'0': gain= 15x
'1': gain= 10x </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_MIXER_CTRL1_BLE_REG</name>
	
	<addressOffset>0x000000a0</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000035</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>MIX_SPARE_BLE</name>
	<description>Spare registers for mixer control </description>
	<access>read-write</access>
	<bitRange>[15:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MIX_TRIM_VCM_BLE</name>
	<description>Trim the common mode voltage at the input of the TIA
0: Minimum voltage
8: Nominal voltage
F: Maximal voltage </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MIX_TRIM_IBIAS_BLE</name>
	<description>Trim the bias current of the TIA
0: Minimum bias current
8: Nominal bias current
F: Maximal bias current </description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MIX_TRIM_GMBIAS_BLE</name>
	<description>Trim the Mixer bias resistor for optimum transcunductance
0: Minimum transconductance
8: Nominal transconductance
F: Maximal transconductance </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_MIXER_CTRL1_FTDF_REG</name>
	
	<addressOffset>0x000000a2</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000035</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>MIX_SPARE</name>
	<description>Spare registers for mixer control </description>
	<access>read-write</access>
	<bitRange>[15:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MIX_TRIM_VCM_FTDF</name>
	<description>Trim the common mode voltage at the input of the TIA
0: Minimum voltage
8: Nominal voltage
F: Maximal voltage </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MIX_TRIM_IBIAS_FTDF</name>
	<description>Trim the bias current of the TIA
0: Minimum bias current
8: Nominal bias current
F: Maximal bias current </description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MIX_TRIM_GMBIAS_FTDF</name>
	<description>Trim the Mixer bias resistor for optimum transcunductance
0: Minimum transconductance
8: Nominal transconductance
F: Maximal transconductance </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_MIXER_CTRL2_REG</name>
	
	<addressOffset>0x000000a4</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000000c</resetValue>
	<resetMask>0x0000ffbf</resetMask>
	<fields>
	<field>
	<name>MIX_CAL_SELECT</name>
	<description>0: use IF_CAL_CAP_BLE/FTDF_SET1, depending on mode. MIX_CAL_CAP_WR is added as offset.
1: use MIX_CAL_CAP_WR directly</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MIX_CAL_CAP_WR</name>
	<description>External value for calibration of mixer pole capacitance </description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_MIX_CAL_CAP_STAT_REG</name>
	<description>Current CAL_CAP value applied to IF</description>
	<addressOffset>0x000000ec</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>MIX_CAL_CAP_RD</name>
	
	<access>read-only</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_OVERRULE_REG</name>
	
	<addressOffset>0x00000010</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00004000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CN_FTDF_TIMES2</name>
	<description>If set, the CN applied to the dphy from the FTDF MAC is multiplied by 2.</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>GAUSS_DAC_SEL</name>
	<description>Overrule GAUSS_DAC_SEL
0b01 = disabled.
0b1x = enabled.
0b00 = normal function</description>
	<access>read-write</access>
	<bitRange>[13:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TXDAC_SEL</name>
	<description>Overrule TXDAC_SEL
0b01 = disabled.
0b1x = enabled.
0b00 = normal function</description>
	<access>read-write</access>
	<bitRange>[11:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MIX_FTDF_OVR</name>
	<description>Overrule MIX_FTDF_EN
0b01 = disabled.
0b1x = enabled.
0b00 = normal function</description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>IFF_FTDF_OVR</name>
	<description>Overrule IFF_FTDF_EN
0b01 = disabled.
0b1x = enabled.
0b00 = normal function</description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RF_MODE_OVR</name>
	<description>Overrule RF_MODE
0b01 = BLE mode.
0b1x = FTDF mode
0b00 = normal function</description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RX_EN_OVR</name>
	<description>Overrule RX_EN:
0b01 = disabled.
0b1x = enabled.
0b00 = normal function</description>
	<access>read-write</access>
	<bitRange>[3:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TX_EN_OVR</name>
	<description>Overrule TX_EN:
0b01 = disabled.
0b1x = enabled.
0b00 = normal function</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_PA_CTRL_REG</name>
	<description>Removed obsolete values of bits 10:7, pa_pw back to 4</description>
	<addressOffset>0x00000090</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00007860</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields>
	<field>
	<name>LEVEL_LDO_RFPA</name>
	<description>Control for PA supply voltage (output power) </description>
	<access>read-write</access>
	<bitRange>[14:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PA_RAMPSPEED</name>
	<description>Ramping speed setting of the driver stage:
'0x0': slowest (1.25 uA)
'0x1': 2x faster (2.5 uA)
'0x2': default ramping speed
'0x3': fastest </description>
	<access>read-write</access>
	<bitRange>[6:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_PFD_CTRL_REG</name>
	
	<addressOffset>0x00000096</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PFD_POLARITY</name>
	<description>'0': Normal operation (UP: implies RCLK leads NCLK)
'1': Inverted operation (UP: implies NCLK leads RCLK) </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>FIXED_CUR_EN</name>
	<description>Enable manual override of PFD output
'0': Normal operation
'1': PFD ouput given by FIXED_CUR_SET </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>FIXED_CUR_SET</name>
	<description>Set the PFD output in a fixed position such that the CP output current is constant'0': UP = 0, DN = 0
'1': UP = 0, DN = 1
'2': UP = 1, DN = 0
'3': UP = 1, DN = 1 </description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_REF_OSC_BLE_REG</name>
	
	<addressOffset>0x00000042</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000029ac</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CNT_CLK</name>
	<description>number of clock pulses corresponding to the value of CNT_RO </description>
	<access>read-write</access>
	<bitRange>[14:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CNT_RO</name>
	<description>number of reference oscillator periods that need to be counted </description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_REF_OSC_FTDF_REG</name>
	
	<addressOffset>0x00000044</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000029ac</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CNT_CLK</name>
	<description>number of clock pulses corresponding to the value of CNT_RO </description>
	<access>read-write</access>
	<bitRange>[14:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CNT_RO</name>
	<description>number of reference oscillator periods that need to be counted </description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_SCAN_FEEDBACK_REG</name>
	
