andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14681-01.xml
	<addressOffset>0x00000040</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CP_CUR</name>
	<description>Cp_cur value during scan. </description>
	<access>read-only</access>
	<bitRange>[7:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LF_RES</name>
	<description>Lf_res value during scan. </description>
	<access>read-only</access>
	<bitRange>[3:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_SPARE1_BLE_REG</name>
	
	<addressOffset>0x00000080</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ff87</resetMask>
	<fields>
	<field>
	<name>VCO_AMPL_SET_TX</name>
	
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RFCU_TXRX_EN_OLD</name>
	<description>0: Use the fixed signals for RX_EN_MUX/TX_EN_MUX register multiplexing in RFCU
1: Use the old scenario, which results in CRC errors</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RF_VTUNE_TO_ADC_TEST_EN</name>
	<description>Enable the connection of Vtune to the GPADC</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RF_XTAL_PLL_DXTAL16_TEST</name>
	<description>Connect the PLL output of the xtal oscillator to the digital driver of P17</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RF_XTAL_RFCLK_TEST</name>
	<description>Connect the RFCLK output of the xtal oscillator to the digital driver of P14</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_SPARE1_FTDF_REG</name>
	
	<addressOffset>0x00000082</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000f807</resetMask>
	<fields>
	<field>
	<name>DEM_PAD_SAT_TO_ZERO</name>
	
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DEM_PAD_WRAP</name>
	
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>VCO_COARSECAL_DELAY</name>
	<description>Controls the added delay which is used to enable the MDstate counter.
0b00: The MDstate counts 2 cycles longer
0bx1: The MDstate counts 1 cycle longer
0b10: The MDstate counts 0 cycles longer</description>
	<access>read-write</access>
	<bitRange>[13:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DEM_AFC_ACTIVATION_MODE</name>
	<description>1: AFC is activated as soon as DEM is enabled (AFC starts with POLE2 programmed value)
0: POLE2 is forced to 0 (and thus AFC remains disabled) until RF input signal is detected</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RF_VTUNE_TO_ADC_TEST_EN</name>
	<description>Enable the connection of Vtune to the GPADC</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RF_XTAL_PLL_DXTAL16_TEST</name>
	<description>Connect the PLL output of the xtal oscillator to the digital driver of P17</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RF_XTAL_RFCLK_TEST</name>
	<description>Connect the RFCLK output of the xtal oscillator to the digital driver of P14</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_TDC_CTRL_REG</name>
	<description>TDC settings</description>
	<addressOffset>0x000000a8</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>TDC_CONNECT</name>
	<description>'0': Normal Operation (no measurement possible)
'1': Connect the PFD inputs also to the TDC inputs
</description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>REF_CTRL</name>
	<description>Select how calibration is performed.
Phase 1:
'0': Count during 1 RCLK period (expect 60-70 as result)
'1': Count during 2 RCLK period (expect 120-140 as result)
'2': Count during 3 RCLK period (expect 180 -210 as result)
'3': not allowed
Phase 2, base the resolution measurement on:
'0': 1 overlap of fast and slow oscillators (NF=NS+1)
'1': 2 overlaps of fast and slow oscillators (NF=NS+2)
'2': 1 overlap of fast and slow oscillators (NF=NS+1)
'3': Not allowed
</description>
	<access>read-write</access>
	<bitRange>[11:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CAL_PH_2</name>
	<description>Select calibration option 2
'0': normal operation (pfd measurement mode or cal mode 1)
'1': measure the slow - fast oscillator period (calibration phase 2)
------- Note CAL_PH_1 must be 0 in this setting
</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CAL_PH_1</name>
	<description>Select calibration option 1
'0': normal operation (pfd measurement or cal mode 2)
'1': measure the fast oscillator period (calibration phase 1)
------- Note: CAL_PH_2 must be 0 in this setting
</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CTRL_SLOW</name>
	<description>Trim the slow oscillator
'0': Minimum frequency (default)
'F': Maximum frequency
</description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CTRL_FAST</name>
	<description>Trim the fast oscillator
'0': mimimum frequency
'F': maximum frequency

</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_TXDAC_CTRL_REG</name>
	<description>Control settings for the TXDAC</description>
	<addressOffset>0x000000da</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields>
	<field>
	<name>TXDAC_CAP_SEL</name>
	<description>Bandwidth setting of the TXDAC</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_TX_PWR_LUT_1_REG</name>
	<description>TX Power setting 1</description>
	<addressOffset>0x000000c2</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>TX_PWR_RF_LNA_CTRL3_REG</name>
	<description>Value for RF_LNA_CTRL3_REG&lt;4:0&gt; in TX mode when RF_TX_PWR_REG&lt;2:0&gt;=1</description>
	<access>read-write</access>
	<bitRange>[10:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TX_PWR_RF_PA_CTRL_REG</name>
	<description>Value for RF_PA_CTRL_REG&lt;14:11&gt; in TX mode when RF_TX_PWR_REG&lt;2:0&gt;=1</description>
	<access>read-write</access>
	<bitRange>[5:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TX_PWR_RF_IO_CTRL1_REG</name>
	<description>Value for RF_IO_CTRL1_REG&lt;1:0&gt; in TX mode when RF_TX_PWR_REG &lt;2:0&gt; = 1</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_TX_PWR_LUT_2_REG</name>
	<description>TX Power setting 2</description>
	<addressOffset>0x000000c4</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>TX_PWR_RF_LNA_CTRL3_REG</name>
	<description>Value for RF_LNA_CTRL3_REG&lt;4:0&gt; in TX mode when RF_TX_PWR_REG&lt;2:0&gt;=2</description>
	<access>read-write</access>
	<bitRange>[10:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TX_PWR_RF_PA_CTRL_REG</name>
	<description>Value for RF_PA_CTRL_REG&lt;14:11&gt; in TX mode when RF_TX_PWR_REG&lt;2:0&gt;=2</description>
	<access>read-write</access>
	<bitRange>[5:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TX_PWR_RF_IO_CTRL1_REG</name>
	<description>Value for RF_IO_CTRL1_REG&lt;1:0&gt; in TX mode when RF_TX_PWR_REG &lt;2:0&gt; = 2</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_TX_PWR_LUT_3_REG</name>
	<description>TX Power setting 3</description>
	<addressOffset>0x000000c6</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>TX_PWR_RF_LNA_CTRL3_REG</name>
	<description>Value for RF_LNA_CTRL3_REG&lt;4:0&gt; in TX mode when RF_TX_PWR_REG&lt;2:0&gt;=3</description>
	<access>read-write</access>
	<bitRange>[10:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TX_PWR_RF_PA_CTRL_REG</name>
	<description>Value for RF_PA_CTRL_REG&lt;14:11&gt; in TX mode when RF_TX_PWR_REG&lt;2:0&gt;=3</description>
	<access>read-write</access>
	<bitRange>[5:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TX_PWR_RF_IO_CTRL1_REG</name>
	<description>Value for RF_IO_CTRL1_REG&lt;1:0&gt; in TX mode when RF_TX_PWR_REG &lt;2:0&gt; = 3</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_TX_PWR_LUT_4_REG</name>
	<description>TX Power setting 4</description>
	<addressOffset>0x000000c8</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>TX_PWR_RF_LNA_CTRL3_REG</name>
	<description>Value for RF_LNA_CTRL3_REG&lt;4:0&gt; in TX mode when RF_TX_PWR_REG&lt;2:0&gt;=4</description>
	<access>read-write</access>
	<bitRange>[10:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TX_PWR_RF_PA_CTRL_REG</name>
	<description>Value for RF_PA_CTRL_REG&lt;14:11&gt; in TX mode when RF_TX_PWR_REG&lt;2:0&gt;=4</description>
	<access>read-write</access>
	<bitRange>[5:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TX_PWR_RF_IO_CTRL1_REG</name>
	<description>Value for RF_IO_CTRL1_REG&lt;1:0&gt; in TX mode when RF_TX_PWR_REG &lt;2:0&gt; = 4</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_TX_PWR_LUT_5_REG</name>
	<description>TX Power setting 5</description>
	<addressOffset>0x000000ca</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>TX_PWR_RF_LNA_CTRL3_REG</name>
	<description>Value for RF_LNA_CTRL3_REG&lt;4:0&gt; in TX mode when RF_TX_PWR_REG&lt;2:0&gt;=5</description>
	<access>read-write</access>
	<bitRange>[10:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TX_PWR_RF_PA_CTRL_REG</name>
	<description>Value for RF_PA_CTRL_REG&lt;14:11&gt; in TX mode when RF_TX_PWR_REG&lt;2:0&gt;=5</description>
	<access>read-write</access>
	<bitRange>[5:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TX_PWR_RF_IO_CTRL1_REG</name>
	<description>Value for RF_IO_CTRL1_REG&lt;1:0&gt; in TX mode when RF_TX_PWR_REG &lt;2:0&gt; = 5</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_TX_PWR_LUT_6_REG</name>
	<description>TX Power setting 6</description>
	<addressOffset>0x000000ce</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>TX_PWR_RF_LNA_CTRL3_REG</name>
	<description>Value for RF_LNA_CTRL3_REG&lt;4:0&gt; in TX mode when RF_TX_PWR_REG&lt;2:0&gt;=6</description>
	<access>read-write</access>
	<bitRange>[10:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TX_PWR_RF_PA_CTRL_REG</name>
	<description>Value for RF_PA_CTRL_REG&lt;14:11&gt; in TX mode when RF_TX_PWR_REG&lt;2:0&gt;=6</description>
	<access>read-write</access>
	<bitRange>[5:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TX_PWR_RF_IO_CTRL1_REG</name>
	<description>Value for RF_IO_CTRL1_REG&lt;1:0&gt; in TX mode when RF_TX_PWR_REG &lt;2:0&gt; = 6</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_TX_PWR_LUT_7_REG</name>
	<description>TX Power setting 7</description>
	<addressOffset>0x000000cc</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>TX_PWR_RF_LNA_CTRL3_REG</name>
	<description>Value for RF_LNA_CTRL3_REG&lt;4:0&gt; in TX mode when RF_TX_PWR_REG&lt;2:0&gt;=7</description>
	<access>read-write</access>
	<bitRange>[10:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TX_PWR_RF_PA_CTRL_REG</name>
	<description>Value for RF_PA_CTRL_REG&lt;14:11&gt; in TX mode when RF_TX_PWR_REG&lt;2:0&gt;=7</description>
	<access>read-write</access>
	<bitRange>[5:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TX_PWR_RF_IO_CTRL1_REG</name>
	<description>Value for RF_IO_CTRL1_REG&lt;1:0&gt; in TX mode when RF_TX_PWR_REG &lt;2:0&gt; = 7</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_TX_PWR_LUT_RD_REG</name>
	<description>TX Power read back</description>
	<addressOffset>0x000000d0</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>RF_TX_PWR_LUT_RD</name>
	<description>Output of mux, controlled by TX_POWER_SET</description>
	<access>read-only</access>
	<bitRange>[10:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_TX_PWR_REG</name>
	<description>TX Power setting</description>
	<addressOffset>0x000000c0</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields>
	<field>
	<name>TX_POWER_SET</name>
	<description>Use settings from RF_TX_PWR_LUT_x_REG&lt;11:0&gt; , when zero OR in RX mode the LUT functionality is not used. </description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_VCOVAR_CTRL_REG</name>
	
