andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14681-01.xml
	<addressOffset>0x000000bc</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000006</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>iffmix_bias_sh_ftdf_dcf_tx</name>
	<description>DCF timer for iffmix_bias_sh_open in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>iffmix_bias_sh_ftdf_dcf_rx</name>
	<description>DCF timer for iffmix_bias_sh_open in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG31_BLE_REG</name>
	
	<addressOffset>0x0000003e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000000a0</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>gauss_bias_sh_ble_dcf_tx</name>
	<description>DCF timer for gauss_bias_sh in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>gauss_bias_sh_ble_dcf_rx</name>
	<description>DCF timer for gauss_bias_sh in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG31_FTDF_REG</name>
	
	<addressOffset>0x000000be</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000000a0</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>gauss_bias_sh_ftdf_dcf_tx</name>
	<description>DCF timer for gauss_bias_sh in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>gauss_bias_sh_ftdf_dcf_rx</name>
	<description>DCF timer for gauss_bias_sh in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG32_BLE_REG</name>
	
	<addressOffset>0x00000040</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000006</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>mix_bias_sh_ble_dcf_tx</name>
	<description>DCF timer for pa_bias_sh_open in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>mix_bias_sh_ble_dcf_rx</name>
	<description>DCF timer for pa_bias_sh_open in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG32_FTDF_REG</name>
	
	<addressOffset>0x000000c0</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000006</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>mix_bias_sh_ftdf_dcf_tx</name>
	<description>DCF timer for pa_bias_sh_open in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>mix_bias_sh_ftdf_dcf_rx</name>
	<description>DCF timer for pa_bias_sh_open in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG33_BLE_REG</name>
	
	<addressOffset>0x00000042</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000063</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>pll_dig_en_ble_dcf_tx</name>
	<description>DCF timer for plldig_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>pll_dig_en_ble_dcf_rx</name>
	<description>DCF timer for pll_dig_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG33_FTDF_REG</name>
	
	<addressOffset>0x000000c2</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000063</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>pll_dig_en_ftdf_dcf_tx</name>
	<description>DCF timer for plldig_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>pll_dig_en_ftdf_dcf_rx</name>
	<description>DCF timer for pll_dig_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG34_BLE_REG</name>
	
	<addressOffset>0x00000044</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000000e7</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>pllclosed_en_ble_dcf_tx</name>
	<description>DCF timer for pllclosed_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>pllclosed_en_ble_dcf_rx</name>
	<description>DCF timer for pllclosed_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG34_FTDF_REG</name>
	
	<addressOffset>0x000000c4</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000000e7</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>pllclosed_en_ftdf_dcf_tx</name>
	<description>DCF timer for pllclosed_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>pllclosed_en_ftdf_dcf_rx</name>
	<description>DCF timer for pllclosed_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG35_BLE_REG</name>
	
