andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14681-01.xml
	<addressOffset>0x00000046</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000008</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>dem_en_ble_dcf_tx</name>
	<description>DCF timer for dem_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>dem_en_ble_dcf_rx</name>
	<description>DCF timer for dem_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG35_FTDF_REG</name>
	
	<addressOffset>0x000000c6</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000008</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>dem_en_ftdf_dcf_tx</name>
	<description>DCF timer for dem_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>dem_en_ftdf_dcf_rx</name>
	<description>DCF timer for dem_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG36_BLE_REG</name>
	
	<addressOffset>0x00000048</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000021</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>ldo_zero_en_ble_dcf_tx</name>
	<description>DCF timer for ldo_zero_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ldo_zero_en_ble_dcf_rx</name>
	<description>DCF timer for ldo_zero_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG36_FTDF_REG</name>
	
	<addressOffset>0x000000c8</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000021</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>ldo_zero_en_ftdf_dcf_tx</name>
	<description>DCF timer for ldo_zero_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ldo_zero_en_ftdf_dcf_rx</name>
	<description>DCF timer for ldo_zero_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG37_BLE_REG</name>
	
	<addressOffset>0x0000004a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000001ce</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>cal_en_ble_dcf_tx</name>
	<description>DCF timer for cal_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>cal_en_ble_dcf_rx</name>
	<description>DCF timer for cal_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG37_FTDF_REG</name>
	
	<addressOffset>0x000000ca</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000001ce</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>cal_en_ftdf_dcf_tx</name>
	<description>DCF timer for cal_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>cal_en_ftdf_dcf_rx</name>
	<description>DCF timer for cal_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG38_BLE_REG</name>
	
	<addressOffset>0x0000004c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>tdc_en_ble_dcf_tx</name>
	<description>DCF timer for tdc_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>tdc_en_ble_dcf_rx</name>
	<description>DCF timer for tdc_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG38_FTDF_REG</name>
	
	<addressOffset>0x000000cc</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>tdc_en_ftdf_dcf_tx</name>
	<description>DCF timer for tdc_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>tdc_en_ftdf_dcf_rx</name>
	<description>DCF timer for tdc_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG39_BLE_REG</name>
	
	<addressOffset>0x0000004e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000042</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>ldo_rfio_en_ble_dcf_tx</name>
	<description>DCF timer for ldo_rfio_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ldo_rfio_en_ble_dcf_rx</name>
	<description>DCF timer for ldo_rfio_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG39_FTDF_REG</name>
	
	<addressOffset>0x000000ce</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000042</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>ldo_rfio_en_ftdf_dcf_tx</name>
	<description>DCF timer for ldo_rfio_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ldo_rfio_en_ftdf_dcf_rx</name>
	<description>DCF timer for ldo_rfio_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG3_BLE_REG</name>
	
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000042</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>mix_ldo_en_ble_dcf_tx</name>
	<description>DCF timer for mix_ldo_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>mix_ldo_en_ble_dcf_rx</name>
	<description>DCF timer for mix_ldo_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG3_FTDF_REG</name>
	
	<addressOffset>0x00000086</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000042</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>mix_ldo_en_ftdf_dcf_tx</name>
	<description>DCF timer for mix_ldo_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>mix_ldo_en_ftdf_dcf_rx</name>
	<description>DCF timer for mix_ldo_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG40_BLE_REG</name>
	
	<addressOffset>0x00000050</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000140</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>rfio_bias_en_ble_dcf_tx</name>
	<description>DCF timer for rfio_bias_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>rfio_bias_en_ble_dcf_rx</name>
	<description>DCF timer for rfio_bias_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG40_FTDF_REG</name>
	
